src/DataProcessors/КассовыйСервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>КассовыйСервер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОчередьКассовогоСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьКассовогоСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПробития</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФискальногоЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаПробитияЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеансаИБ</Name>
					<Comment>Номер сеанса ИБ, в которой пробивался чек </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПробитияЧекаКассовымСервером</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПробитияЧекаКассовымСервером.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПробитияЧекаКассовымСервером</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробивается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/КассовыйСервер/Forms/ФормаДиалога/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Документ);
	Параметры.Свойство("Статус"  , Статус);
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Элементы.ГруппаОткрытьДокумент.Видимость = Ложь;
		Элементы.ГруппаОткрытьКлиента.Видимость  = Ложь;
	Иначе
		Клиент = Документ.Контрагент;
	КонецЕсли;
	
	Если НЕ Статус = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ошибка Тогда
		Элементы.ГруппаПовторноеПробитие.Видимость = Ложь;		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик события "команды".
//
Процедура ОткрытьДокумент(Команда)
	
	ЭтаФорма.Закрыть();
	ПоказатьЗначение(, Документ);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "команды".
//
Процедура ОткрытьКлиента(Команда)
	
	ЭтаФорма.Закрыть();
	ПоказатьЗначение(, Клиент);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "команды".
//
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "команды".
//
Процедура ПовторитьПробитиеЧека(Команда)
	
	ОбновитьСтатусДокументаНаКассовомСервере(Документ);
	ЭтаФорма.Закрыть(Новый Структура("ОбновитьСписок", Истина));	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, обновляет данные в кассовой очереди.
//
Процедура ОбновитьСтатусДокументаНаКассовомСервере(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОплаты = Документ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.Статус = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ошибка 
		И МенеджерЗаписи.НомерФискальногоЧека = 0 Тогда
		МенеджерЗаписи.КоличествоПопыток  = 0;
		МенеджерЗаписи.Статус             = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ожидание;
		МенеджерЗаписи.ОшибкаПробитияЧека = "";
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
